Revit 2024 API
SpaceSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual SpaceSetIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As SpaceSetIterator
Visual C++
public:
virtual SpaceSetIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the set.
See Also
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace